# DisplayingOptionsDialogEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplayingOptionsDialogEventArgs Class
Members See Also
---
The event arguments used by DisplayingOptionDialog event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DisplayingOptionsDialogEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class DisplayingOptionsDialogEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class DisplayingOptionsDialogEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.UI.Events..::..DisplayingOptionsDialogEventArgs
# See Also
DisplayingOptionsDialogEventArgs Members
Autodesk.Revit.UI.Events Namespace